package course4.advanced.topic04;
import java.util.regex.Matcher;
import java.util.regex.Pattern;

public class Decryptor {
    private static String text = "У «Золотому Дворі», солідному заїзді містечка, було людно й гамірно. " +
            "Гості, місцеві і приїжджі переважно займалися справами, типовими для своєї нації чи професії. " +
            "Поважні купці сварилися із ґномами за ціни на товари та проценти по кредитах. " +
            "Місцеві недоумки вдавали із себе добре поінформованих. " +
            "Дівки намагалися сподобатися тим, хто мав грошенята, одночасно віднаджуючи тих, хто грошенят не мав. " +
            "Візники й рибалки пили так, наче зранку заборонять розводити хміль. " +
            "Моряки співали пісеньку, що славила морські хвилі, відвагу капітанів і принади сирен – останнє мальовничо й детально.";

    public static void main(String[] args) {
        //(^|(?<!\p{L})) Перевіряє, чи перед словом є початок рядка (^) або немає літери ((?<!\p{L}))
        //(?!\p{L}) Перевіряє, чи після слова немає літери
        Pattern p = Pattern.compile("(^|(?<!\\p{L}))(в|у|з|із|зі|на|під|перед|про|при|по|без|від|для|до|за|через|задля|понад|навколо|всупереч)(?!\\p{L})",Pattern.CASE_INSENSITIVE | Pattern.UNICODE_CASE);
        Matcher m = p.matcher(text);
        String updatedText = m.replaceAll("Java");
        System.out.println(updatedText);
    }
}
